app/controllers/people_controller.rb

SELECT * FROM "person" WHERE (first_name LIKE 'Mary%' AND last_name LIKE 'Banda%' AND gender = 'Female%')
SELECT * FROM "outcome" WHERE ("outcome".person_id = 1) ORDER BY outcome.outcome_id DESC LIMIT 1
SELECT * FROM "relationship" WHERE ("relationship".person_a_id = 1)
---
  def load_all_people
    result = {}

    Person.all.each do |p|

      result[p.person_id] = {
        "id" => p.person_id,
        "first_name" => p.first_name,
        "middle_name" => (!p.middle_name.blank? ? p.middle_name : "&nbsp;"),
        "last_name" => p.last_name,
        "gender" => p.gender,
        "dob" => p.date_of_birth,
        "occupation" => p.occupation,
        "outcome" => ((p.outcomes.length > 0 ? p.outcomes.last.type.name : "&nbsp;")),
        "outcome_date" => (p.outcomes.last.outcome_date rescue "&nbsp;"),
        "date_created" => (!p.date_created.blank? ? p.date_created : "&nbsp;"),
        "identifiers" => (p.identifiers.map{|id| id.identifier}.join("<br/>") + "&nbsp;" rescue "&nbsp;"),
        "relations" => (p.relationships.collect{|rl|
            "#{rl.relative.first_name} #{rl.relative.last_name} (<span id='lbl_#{rl.type.name.downcase}'>#{rl.type.name}</span>)"
          }.join("<br/>") + "&nbsp;")

SELECT * FROM "outcome_type" WHERE ("outcome_type"."name" = 'Transfer Out') LIMIT 1
---
  def updateOutcome
    t = OutcomeType.find_by_name(params["1.5"]) # .id rescue nil

SELECT * FROM "relationship_type" WHERE ("relationship_type"."name" = 'Spouse') LIMIT 1
INSERT INTO "relationship" ("relationship_type", "person_a_id", "person_b_id", "date_created") VALUES(3, 1, 2, '2013-03-20')
---
  def savePersonRelationship
    r = RelationshipType.find_by_name(params["1.9"])

    unless r.nil?
      p = Relationship.new(
        :person_a_id => params["1.4"].to_i,
        :person_b_id => params["1.8"].to_i,
        :relationship_type => r.id,
        :date_created => Date.today.strftime("%Y-%m-%d")
      )

      p.save